
## :x: Apply Failed

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21701580110)



<pre><code>Error: failed to create application cluster-config

  with argocd_application.cluster_config,
  on argocd.tf line 50, in resource &#34;argocd_application&#34; &#34;cluster_config&#34;:
  50: resource &#34;argocd_application&#34; &#34;cluster_config&#34; {

rpc error: code = InvalidArgument desc = application spec for cluster-config
is invalid: InvalidSpecError: Unable to generate manifests in
clusters/prod.malachowski.me: rpc error: code = Unknown desc =
clusters/prod.malachowski.me: app path does not exist

Error: Error creating WorkloadIdentityPool: googleapi: Error 409: Requested entity already exists

  with google_iam_workload_identity_pool.kubernetes,
  on external-secret-operator.tf line 28, in resource &#34;google_iam_workload_identity_pool&#34; &#34;kubernetes&#34;:
  28: resource &#34;google_iam_workload_identity_pool&#34; &#34;kubernetes&#34; {


Error: gcpsm-secret-store failed to create kubernetes rest client for update of resource: resource [external-secrets.io/v1beta1/ClusterSecretStore] isn&#39;t valid for cluster, check the APIVersion and Kind fields are valid

  with kubectl_manifest.secret_store_gcp,
  on external-secret-operator.tf line 380, in resource &#34;kubectl_manifest&#34; &#34;secret_store_gcp&#34;:
 380: resource &#34;kubectl_manifest&#34; &#34;secret_store_gcp&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl
data.cloudflare_zone.this: Reading...
module.talos.data.hcloud_image.x86[0]: Reading...
module.talos.data.hcloud_locations.all: Reading...
data.google_secret_manager_secret_version.argocd_app_pem_key: Reading...
data.cloudflare_zone.this: Read complete after 0s [id=aff336ce5012d1e29eb613ba0ec54d9a]
module.talos.data.hcloud_image.x86[0]: Read complete after 0s
module.talos.data.hcloud_locations.all: Read complete after 0s [id=7c4a8d09ca3762af61e59520943dc26494f8941b]
module.talos.data.hcloud_location.selected: Reading...
module.talos.data.hcloud_location.selected: Read complete after 0s [name=hel1]
data.google_secret_manager_secret_version.argocd_app_pem_key: Read complete after 1s [id=projects/671067631752/secrets/argocd-gh-app-pem-key/versions/1]
module.talos.data.helm_template.hcloud_ccm[0]: Reading...
module.talos.data.helm_template.cilium_default[0]: Reading...
module.talos.data.helm_template.hcloud_ccm[0]: Read complete after 0s [id=hcloud-cloud-controller-manager]
module.talos.data.kubectl_file_documents.hcloud_ccm[0]: Reading...
module.talos.data.kubectl_file_documents.hcloud_ccm[0]: Read complete after 0s [id=19d5209916550a4fd086f43a8dac60d510afeec6d335b1bdb70d096a52849a7f]
module.talos.data.helm_template.cilium_default[0]: Read complete after 0s [id=cilium]
module.talos.data.kubectl_file_documents.cilium[0]: Reading...
module.talos.data.kubectl_file_documents.cilium[0]: Read complete after 0s [id=c59f2d610804ad1ab424358ff3a06838e7d94e803d0aa990046d71655b9b5ff0]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.kubernetes_secret_v1.argo_cluser_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret_v1" "argo_cluser_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # argocd_application.cluster_config will be created
  + resource "argocd_application" "cluster_config" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = false

      + metadata {
          + generation       = (known after apply)
          + name             = "cluster-config"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "clusters/prod.malachowski.me"
              + repo_url        = "https://github.com/malachowski-labs/manifests"
              + target_revision = "HEAD"

              + directory {
                  + recurse = true
                }
            }

          + sync_policy {
              + sync_options = [
                  + "ServerSideApply=true",
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # argocd_application.traefik will be created
  + resource "argocd_application" "traefik" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-traefik-chart"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "traefik"
              + repo_url        = "https://github.com/traefik/traefik-helm-chart.git"
              + target_revision = "v38.0.2"

              + helm {
                  + values = <<-EOT
                        logs:
                                    general:
                                      level: INFO
                                    access:
                                      enabled: true
                                  service:
                                    annotations:
                                      load-balancer.hetzner.cloud/location: hel1
                                      load-balancer.hetzner.cloud/name: prod-malachowski-me-lb
                    EOT
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # cloudflare_dns_record.this will be created
  + resource "cloudflare_dns_record" "this" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # cloudflare_dns_record.wildcard will be created
  + resource "cloudflare_dns_record" "wildcard" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "*.malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # google_iam_workload_identity_pool.kubernetes will be created
  + resource "google_iam_workload_identity_pool" "kubernetes" {
      + description               = "Workload Identity Pool for Kubernetes cluster"
      + disabled                  = false
      + display_name              = "Kubernetes Workload Identity"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "malachowski"
      + state                     = (known after apply)
      + workload_identity_pool_id = "kubernetes-pool"
    }

  # google_iam_workload_identity_pool_provider.kubernetes_oidc will be created
  + resource "google_iam_workload_identity_pool_provider" "kubernetes_oidc" {
      + attribute_condition                = "assertion.sub.startsWith('system:serviceaccount:external-secrets:')"
      + attribute_mapping                  = {
          + "attribute.kubernetes_namespace" = "assertion['kubernetes.io'].namespace"
          + "attribute.kubernetes_pod"       = "assertion['kubernetes.io'].pod.name"
          + "attribute.kubernetes_sa"        = "assertion['kubernetes.io'].serviceaccount.name"
          + "google.subject"                 = "assertion.sub"
        }
      + description                        = "OIDC provider for Kubernetes service accounts"
      + disabled                           = false
      + display_name                       = "Kubernetes OIDC Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "malachowski"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "kubernetes-pool"
      + workload_identity_pool_provider_id = "kubernetes-oidc-provider"

      + oidc {
          + issuer_uri = "https://oidc.malachowski.me"
        }
    }

  # google_project_iam_member.external_secrets_secret_accessor will be created
  + resource "google_project_iam_member" "external_secrets_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + project = "malachowski"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_service_account.external_secrets will be created
  + resource "google_service_account" "external_secrets" {
      + account_id   = "external-secrets-operator"
      + description  = "Service Account used by External Secrets Operator via Workload Identity Federation"
      + disabled     = false
      + display_name = "External Secrets Operator Service Account"
      + email        = "external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:external-secrets-operator@malachowski.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "malachowski"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.workload_identity_binding will be created
  + resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # hcloud_load_balancer.this will be created
  + resource "hcloud_load_balancer" "this" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = "lb11"
      + location           = "hel1"
      + name               = "prod-malachowski-me-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm (known after apply)

      + target (known after apply)
    }

  # hcloud_load_balancer_network.this will be created
  + resource "hcloud_load_balancer_network" "this" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = (known after apply)
      + load_balancer_id        = (known after apply)
      + network_id              = (known after apply)
    }

  # hcloud_load_balancer_service.this will be created
  + resource "hcloud_load_balancer_service" "this" {
      + destination_port = 6443
      + id               = (known after apply)
      + listen_port      = 6443
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)

      + health_check (known after apply)

      + http (known after apply)
    }

  # hcloud_load_balancer_target.this will be created
  + resource "hcloud_load_balancer_target" "this" {
      + id               = (known after apply)
      + label_selector   = "role=control-plane"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "7.7.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "installCRDs": true
                "serviceAccount":
                  "create": false
                  "name": "external-secrets-operator"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.3.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.secret_store_gcp will be created
  + resource "kubectl_manifest" "secret_store_gcp" {
      + api_version             = "external-secrets.io/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterSecretStore"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gcpsm-secret-store"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: external-secrets.io/v1beta1
            kind: ClusterSecretStore
            metadata:
              name: gcpsm-secret-store
            spec:
              provider:
                gcpsm:
                  auth:
                    workloadIdentity:
                      clusterLocation: eu
                      clusterName: prod.malachowski.me
                      serviceAccountRef:
                        name: external-secrets-operator
                        namespace: external-secrets
                  projectID: malachowski
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_config_map_v1.oidc_discovery will be created
  + resource "kubernetes_config_map_v1" "oidc_discovery" {
      + data = {
          + "openid-configuration" = jsonencode(
                {
                  + id_token_signing_alg_values_supported = [
                      + "RS256",
                    ]
                  + issuer                                = "https://oidc.malachowski.me"
                  + jwks_uri                              = "https://oidc.malachowski.me/openid/v1/jwks"
                  + response_types_supported              = [
                      + "id_token",
                    ]
                  + subject_types_supported               = [
                      + "public",
                    ]
                }
            )
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "oidc-discovery"
          + namespace        = "oidc-discovery"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map_v1.oidc_nginx_config will be created
  + resource "kubernetes_config_map_v1" "oidc_nginx_config" {
      + data = {
          + "default.conf" = <<-EOT
                server {
                    listen 80;
                    server_name _;
                
                    location /.well-known/openid-configuration {
                        alias /usr/share/nginx/html/.well-known/openid-configuration;
                        add_header Content-Type application/json;
                        add_header Access-Control-Allow-Origin *;
                    }
                
                    location /openid/v1/jwks {
                        proxy_pass https://kubernetes.default.svc.cluster.local/openid/v1/jwks;
                        proxy_ssl_verify off;
                        proxy_set_header Host $host;
                        proxy_set_header X-Real-IP $remote_addr;
                        add_header Access-Control-Allow-Origin *;
                    }
                
                    location / {
                        return 404;
                    }
                }
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "oidc-nginx-config"
          + namespace        = "oidc-discovery"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_deployment_v1.oidc_discovery will be created
  + resource "kubernetes_deployment_v1" "oidc_discovery" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
             

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

dule.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [2m30s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [2m40s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [2m50s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [3m0s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [3m10s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [3m20s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [3m30s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [3m40s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [3m50s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [4m0s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [4m10s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [4m20s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still creating... [4m30s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Creation complete after 4m39s [id=119968032]
module.talos.talos_machine_bootstrap.this[0]: Creating...
module.talos.talos_machine_bootstrap.this[0]: Creation complete after 1s [id=machine_bootstrap]
module.talos.data.http.talos_health[0]: Reading...
module.talos.talos_cluster_kubeconfig.this[0]: Creating...
module.talos.talos_cluster_kubeconfig.this[0]: Creation complete after 1s [id=prod.malachowski.me]
module.talos.data.http.talos_health[0]: Still reading... [10s elapsed]
module.talos.data.http.talos_health[0]: Still reading... [20s elapsed]
module.talos.data.http.talos_health[0]: Still reading... [30s elapsed]
module.talos.data.http.talos_health[0]: Read complete after 31s [id=https://89.167.25.180:6443/version]
module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"]: Creating...
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Creating...
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator"]: Creating...
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/services/cilium-envoy"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator"]: Creating...
module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/services/cilium-envoy"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/services/cilium-envoy"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/services/cilium-envoy"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium"]: Creation complete after 35s [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"]: Creation complete after 36s [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager]
module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"]: Creation complete after 36s [id=/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config"]: Creation complete after 36s [id=/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/services/cilium-envoy"]: Creation complete after 36s [id=/api/v1/namespaces/kube-system/services/cilium-envoy]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"]: Creation complete after 36s [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator"]: Creation complete after 36s [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-config"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium-operator"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium"]: Creation complete after 1s [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium-envoy"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent"]: Creation complete after 1s [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent"]: Creating...
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium"]: Creation complete after 1s [id=/api/v1/namespaces/kube-system/serviceaccounts/cilium]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium-operator"]: Creation complete after 1s [id=/api/v1/namespaces/kube-system/serviceaccounts/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-config"]: Creation complete after 1s [id=/api/v1/namespaces/kube-system/configmaps/cilium-config]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator"]: Creation complete after 37s [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium-envoy"]: Creation complete after 0s [id=/api/v1/namespaces/kube-system/serviceaccounts/cilium-envoy]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent"]: Creation complete after 0s [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [40s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Still creating... [40s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium"]: Still creating... [10s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [50s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Still creating... [50s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Creation complete after 52s [id=/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium"]: Still creating... [20s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [1m0s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium"]: Still creating... [30s elapsed]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [1m10s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy"]: Still creating... [40s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium"]: Still creating... [40s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy"]: Creation complete after 44s [id=/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Still creating... [1m20s elapsed]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium"]: Creation complete after 45s [id=/apis/apps/v1/namespaces/kube-system/daemonsets/cilium]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Creation complete after 1m25s [id=/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager]
kubernetes_namespace_v1.external_secrets: Creating...
kubernetes_namespace_v1.oidc_discovery: Creating...
kubernetes_namespace_v1.argocd: Creating...
kubernetes_namespace_v1.oidc_discovery: Creation complete after 1s [id=oidc-discovery]
kubernetes_namespace_v1.external_secrets: Creation complete after 1s [id=external-secrets]
kubernetes_namespace_v1.argocd: Creation complete after 1s [id=argocd]
kubernetes_service_account_v1.external_secrets: Creating...
kubernetes_config_map_v1.oidc_nginx_config: Creating...
kubernetes_config_map_v1.oidc_discovery: Creating...
kubernetes_config_map_v1.oidc_nginx_config: Creation complete after 0s [id=oidc-discovery/oidc-nginx-config]
kubernetes_config_map_v1.oidc_discovery: Creation complete after 0s [id=oidc-discovery/oidc-discovery]
kubernetes_deployment_v1.oidc_discovery: Creating...
kubernetes_service_account_v1.external_secrets: Creation complete after 0s [id=external-secrets/external-secrets-operator]
helm_release.argocd: Creating...
helm_release.external_secrets: Creating...
kubernetes_deployment_v1.oidc_discovery: Still creating... [10s elapsed]
helm_release.argocd: Still creating... [10s elapsed]
helm_release.external_secrets: Still creating... [10s elapsed]
kubernetes_deployment_v1.oidc_discovery: Still creating... [20s elapsed]
helm_release.argocd: Still creating... [20s elapsed]
helm_release.external_secrets: Still creating... [20s elapsed]
kubernetes_deployment_v1.oidc_discovery: Creation complete after 27s [id=oidc-discovery/oidc-discovery]
kubernetes_service_v1.oidc_discovery: Creating...
kubernetes_service_v1.oidc_discovery: Creation complete after 1s [id=oidc-discovery/oidc-discovery]
kubernetes_ingress_v1.oidc_discovery: Creating...
kubernetes_ingress_v1.oidc_discovery: Creation complete after 0s [id=oidc-discovery/oidc-discovery]
helm_release.argocd: Still creating... [30s elapsed]
helm_release.external_secrets: Still creating... [30s elapsed]
helm_release.argocd: Still creating... [40s elapsed]
helm_release.external_secrets: Still creating... [40s elapsed]
helm_release.argocd: Still creating... [50s elapsed]
helm_release.external_secrets: Still creating... [50s elapsed]
helm_release.external_secrets: Creation complete after 57s [id=external-secrets]
kubectl_manifest.secret_store_gcp: Creating...
helm_release.argocd: Still creating... [1m0s elapsed]
helm_release.argocd: Still creating... [1m10s elapsed]
helm_release.argocd: Creation complete after 1m16s [id=argocd]
data.kubernetes_secret_v1.argo_cluser_password: Reading...
kubernetes_secret_v1.argocd_repo_access: Creating...
data.kubernetes_secret_v1.argo_cluser_password: Read complete after 1s [id=argocd/argocd-initial-admin-secret]
argocd_application.traefik: Creating...
kubernetes_secret_v1.argocd_repo_access: Creation complete after 1s [id=argocd/argo-private-repo-secret]
argocd_application.cluster_config: Creating...
argocd_application.traefik: Still creating... [10s elapsed]
argocd_application.traefik: Still creating... [20s elapsed]
argocd_application.traefik: Still creating... [30s elapsed]
argocd_application.traefik: Still creating... [40s elapsed]
argocd_application.traefik: Still creating... [50s elapsed]
argocd_application.traefik: Still creating... [1m0s elapsed]
argocd_application.traefik: Creation complete after 1m0s [id=argo-traefik-chart:argocd]

Error: failed to create application cluster-config

  with argocd_application.cluster_config,
  on argocd.tf line 50, in resource "argocd_application" "cluster_config":
  50: resource "argocd_application" "cluster_config" {

rpc error: code = InvalidArgument desc = application spec for cluster-config
is invalid: InvalidSpecError: Unable to generate manifests in
clusters/prod.malachowski.me: rpc error: code = Unknown desc =
clusters/prod.malachowski.me: app path does not exist

Error: Error creating WorkloadIdentityPool: googleapi: Error 409: Requested entity already exists

  with google_iam_workload_identity_pool.kubernetes,
  on external-secret-operator.tf line 28, in resource "google_iam_workload_identity_pool" "kubernetes":
  28: resource "google_iam_workload_identity_pool" "kubernetes" {


Error: gcpsm-secret-store failed to create kubernetes rest client for update of resource: resource [external-secrets.io/v1beta1/ClusterSecretStore] isn't valid for cluster, check the APIVersion and Kind fields are valid

  with kubectl_manifest.secret_store_gcp,
  on external-secret-operator.tf line 380, in resource "kubectl_manifest" "secret_store_gcp":
 380: resource "kubectl_manifest" "secret_store_gcp" {

::error::OpenTofu exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"infra-apply","PRNumber":15,"Program":"tfcmt","SHA1":"1a8437ea191444d1c2467402bda341a1742b51fe","Vars":{},"WorkflowName":"infra-apply"} -->